name: "VGG_FACE_16_layer"
layer {
  name: "data"
  type: "Data"
  include {
    phase: TRAIN
  }
 transform_param {
    mirror: false
    scale: 0.003922
 }
 data_param {
    source: "/media/dml/1TbyeAvailable/caffe-moon/dataset/train_img_lmdb"
    batch_size: 50
    backend: LMDB
  }
  top: "data"
}

layer {
  name: "data"
  type: "Data"
  include {
    phase: TEST
  }
 transform_param {
    scale: 0.003922
    mirror: false
 }
 data_param {
    source: "/media/dml/1TbyeAvailable/caffe-moon/dataset/val_imgs_lmdb"
    batch_size: 50
    backend: LMDB
  }
  top: "data"
}





layer {
  bottom: "data"
  top: "conv1"
  name: "conv1"
  param {
    lr_mult: 0
    decay_mult: 0
    name: "conv1w"
  }
  param {
    lr_mult: 0
    decay_mult: 0
    name: "conv1c"
  }
  type: "Convolution"
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
 bottom: "conv1"
 top: "bn_conv1"
 name: "bn_conv1"
 type: "BatchNorm"
 param {
  name: "bn_conv1_d"
 }
 param {
  name: "bn_conv1_e"
 }
 param {
  name: "bn_conv1_f"
 }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "bn_conv1"
  top: "bn_conv1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  bottom: "bn_conv1"
  top: "pool1"
  name: "pool1"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layer {
  bottom: "pool1"
  top: "conv2"
  name: "conv2"
  param {
    lr_mult: 0
    decay_mult: 0
    name: "conv2w"
  }
  param {
    lr_mult: 0
    decay_mult: 0
    name: "conv2c"
  }
  type: "Convolution"
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
 bottom: "conv2"
 top: "bn_conv2"
 name: "bn_conv2"
 type: "BatchNorm"
 param {
  name: "bn_conv2_d"
 }
 param {
  name: "bn_conv2_e"
 }
 param {
  name: "bn_conv2_f"
 }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "bn_conv2"
  top: "bn_conv2"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  bottom: "bn_conv2"
  top: "pool2"
  name: "pool2"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layer {
  bottom: "pool2"
  top: "conv3"
  name: "conv3"
  param {
    lr_mult: 0
    decay_mult: 0
    name: "conv3w"
  }
  param {
    lr_mult: 0
    decay_mult: 0
    name: "conv3c"
  }
  type: "Convolution"
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
 bottom: "conv3"
 top: "bn_conv3"
 name: "bn_conv3"
 type: "BatchNorm"
 param {
  name: "bn_conv3_d"
 }
 param {
  name: "bn_conv3_e"
 }
 param {
  name: "bn_conv3_f"
 }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "bn_conv3"
  top: "bn_conv3"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  bottom: "bn_conv3"
  top: "pool3"
  name: "pool3"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layer {
  bottom: "pool3"
  top: "conv4_1"
  name: "conv4_1"
  param {
    lr_mult: 0
    decay_mult: 0
    name: "conv4_1w"
  }
  param {
    lr_mult: 0
    decay_mult: 0
    name: "conv4_1c"
  }
  type: "Convolution"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
 bottom: "conv4_1"
 top: "bn_conv4_1"
 name: "bn_conv4_1"
 type: "BatchNorm"
 param {
  name: "bn_conv4_1_d"
 }
 param {
  name: "bn_conv4_1_e"
 }
 param {
  name: "bn_conv4_1_f"
 }
}
layer {
  name: "relu4_1"
  type: "ReLU"
  bottom: "bn_conv4_1"
  top: "bn_conv4_1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  bottom: "bn_conv4_1"
  top: "conv4_2"
  name: "conv4_2"
  param {
    lr_mult: 1
    decay_mult: 1
    name: "conv4_2w"
  }
  param {
    lr_mult: 2
    decay_mult: 0
    name: "conv4_2c"
  }
  type: "Convolution"
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
 bottom: "conv4_2"
 top: "bn_conv4_2"
 name: "bn_conv4_2"
 type: "BatchNorm"
 param {
  name: "bn_conv4_2_d"
 }
 param {
  name: "bn_conv4_2_e"
 }
 param {
  name: "bn_conv4_2_f"
 }
}
layer {
  name: "relu4_2"
  type: "ReLU"
  bottom: "bn_conv4_2"
  top: "bn_conv4_2"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  bottom: "bn_conv4_2"
  top: "conv4_3"
  name: "conv4_3"
  param {
    lr_mult: 0
    decay_mult: 0
    name: "conv4_3w"
  }
  param {
    lr_mult: 0
    decay_mult: 0
    name: "conv4_3c"
  }
  type: "Convolution"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
 bottom: "conv4_3"
 top: "bn_conv4_3"
 name: "bn_conv4_3"
 type: "BatchNorm"
 param {
  name: "bn_conv4_3_d"
 }
 param {
  name: "bn_conv4_3_e"
 }
 param {
  name: "bn_conv4_3_f"
 }
}
layer {
  name: "relu4_3"
  type: "ReLU"
  bottom: "bn_conv4_3"
  top: "bn_conv4_3"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  bottom: "bn_conv4_3"
  top: "pool4"
  name: "pool4"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}


layer {
  bottom: "pool4"
  top: "conv5_1"
  name: "conv5_1"
  param {
    lr_mult: 0
    decay_mult: 0
    name: "conv5_1w"
  }
  param {
    lr_mult: 0
    decay_mult: 0
    name: "conv5_1c"
  }
  type: "Convolution"
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  bottom: "conv5_1"
  top: "flat_1"
  name: "flat_1"
  type: "Flatten"
}

layer {
  name: "flat_1_shifted"
  type: "Scale"
  bottom: "flat_1"
  top: "flat_1_shifted"
  scale_param {
    bias_term: true
  }
}

layer {
  bottom: "flat_1_shifted"
  top: "pca_1"
  name: "pca_1"
  type: "InnerProduct"
  inner_product_param {
    num_output: 10
  }
}
layer {
  bottom: "pca_1"
  top: "flat_1_shifted_reconst"
  name: "flat_1_shifted_reconst"
  type: "InnerProduct"
  inner_product_param {
    num_output: 8640
  }
}


layer {
  name: "flat_1_reconst"
  type: "Scale"
  bottom: "flat_1_shifted_reconst"
  top: "flat_1_reconst"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "conv5_1_reconst"
  type: "Reshape"
  bottom: "flat_1_reconst"
  top: "conv5_1_reconst"
  reshape_param { shape: {dim: 50 dim: 32 dim: 18 dim: 15 } }
}

layer {
 bottom: "conv5_1_reconst"
 top: "bn_conv5_1"
 name: "bn_conv5_1"
 type: "BatchNorm"
}
layer {
  name: "relu5_1"
  type: "ReLU"
  bottom: "bn_conv5_1"
  top: "bn_conv5_1"
  relu_param{
    negative_slope: 0.1
  }
}
layer {
  bottom: "bn_conv5_1"
  top: "fc6"
  name: "fc6"
  type: "InnerProduct"
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  bottom: "fc6"
  top: "fc6"
  name: "relu6"
  type: "ReLU"
}
layer {
  name: "defc7"
  type: "InnerProduct"
  bottom: "fc6"
  top: "defc7"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_defc7"
  type: "ReLU"
  bottom: "defc7"
  top: "defc7"
  relu_param {
    negative_slope: 0.3
  }
}
layer {
  name: "defc6"
  type: "InnerProduct"
  bottom: "defc7"
  top: "defc6"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_defc6"
  type: "ReLU"
  bottom: "defc6"
  top: "defc6"
  relu_param {
    negative_slope: 0.3
  }
}
layer {
  name: "defc5"
  type: "InnerProduct"
  bottom: "defc6"
  top: "defc5"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_defc5"
  type: "ReLU"
  bottom: "defc5"
  top: "defc5"
  relu_param {
    negative_slope: 0.3
  }
}
layer {
  name: "reshape"
  type: "Reshape"
  bottom: "defc5"
  top: "reshape_defc5"
  reshape_param {
    shape { 
      dim: 50 
      dim: 256
      dim: 4
      dim: 4
    }
  }
}
layer {
  name: "deconv5"           
  type: "Deconvolution"
  bottom: "reshape_defc5"
  top: "deconv5"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 4
    stride: 2
    weight_filler {
      type: "msra"
#      msra_coeff: 1.8
    }
    bias_filler {
      type: "constant"
    }
#    engine: CUDNN
  }
}
layer {
  name: "relu_deconv5"
  type: "ReLU"
  bottom: "deconv5"
  top: "deconv5"
  relu_param {
    negative_slope: 0.3
  }
}
layer {
  name: "conv5_11"           
  type: "Deconvolution"
  bottom: "deconv5"
  top: "conv5_11"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
 #     msra_coeff: 0.9
    }
    bias_filler {
      type: "constant"
    }
#    engine: CUDNN
  }
}
layer {
  name: "relu_conv5_11"
  type: "ReLU"
  bottom: "conv5_11"
  top: "conv5_11"
  relu_param {
    negative_slope: 0.3
  }
}
layer {
  name: "deconv4"           
  type: "Deconvolution"
  bottom: "conv5_11"
  top: "deconv4"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 4
    stride: 2
    weight_filler {
      type: "msra"
#      msra_coeff: 1.8
    }
    bias_filler {
      type: "constant"
    }
#    engine: CUDNN
  }
}
layer {
  name: "relu_deconv4"
  type: "ReLU"
  bottom: "deconv4"
  top: "deconv4"
  relu_param {
    negative_slope: 0.3
  }
}
layer {
  name: "conv4_11"           
  type: "Deconvolution"
  bottom: "deconv4"
  top: "conv4_11"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
 #     msra_coeff: 0.9
    }
    bias_filler {
      type: "constant"
    }
#    engine: CUDNN
  }
}
layer {
  name: "relu_conv4_11"
  type: "ReLU"
  bottom: "conv4_11"
  top: "conv4_11"
  relu_param {
    negative_slope: 0.3
  }
}
layer {
  name: "deconv3"           
  type: "Deconvolution"
  bottom: "conv4_11"
  top: "deconv3"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 4
    stride: 2
    weight_filler {
      type: "msra"
#      msra_coeff: 1.8
    }
    bias_filler {
      type: "constant"
    }
#    engine: CUDNN
  }
}
layer {
  name: "relu_deconv3"
  type: "ReLU"
  bottom: "deconv3"
  top: "deconv3"
  relu_param {
    negative_slope: 0.3
  }
}
layer {
  name: "conv3_11"           
  type: "Deconvolution"
  bottom: "deconv3"
  top: "conv3_11"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
#      msra_coeff: 0.9
    }
    bias_filler {
      type: "constant"
    }
#    engine: CUDNN
  }
}
layer {
  name: "relu_conv3_11"
  type: "ReLU"
  bottom: "conv3_11"
  top: "conv3_11"
  relu_param {
    negative_slope: 0.3
  }
}
layer {
  name: "deconv2"           
  type: "Deconvolution"
  bottom: "conv3_11"
  top: "deconv2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 4
    stride: 2
    weight_filler {
      type: "msra"
#      msra_coeff: 1.8
    }
    bias_filler {
      type: "constant"
    }
#    engine: CUDNN
  }
}
layer {
  name: "relu_deconv2"
  type: "ReLU"
  bottom: "deconv2"
  top: "deconv2"
  relu_param {
    negative_slope: 0.3
  }
}
layer {
  name: "deconv1"           
  type: "Deconvolution"
  bottom: "deconv2"
  top: "deconv1"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 4
    stride: 2
    weight_filler {
      type: "msra"
#      msra_coeff: 1.8
    }
    bias_filler {
      type: "constant"
    }
#    engine: CUDNN
  }
}
layer {
  name: "relu_deconv1"
  type: "ReLU"
  bottom: "deconv1"
  top: "deconv1"
  relu_param {
    negative_slope: 0.3
  }
}
layer {
  name: "deconv0"           
  type: "Deconvolution"
  bottom: "deconv1"
  top: "deconv0"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 3
    pad: 1
    kernel_size: 4
    stride: 2
    weight_filler {
      type: "msra"
#      msra_coeff: 1.8
    }
    bias_filler {
      type: "constant"
    }
#    engine: CUDNN
  }
}
layer {
  name: "deconv0_crop"
  type: "Crop"
  bottom: "deconv0"
  bottom: "data"
  top: "deconv0_crop"
 # crop_param {
 #    crop_height: 224
 #    crop_width: 224
 # }
}
layer {
  name: "recon_loss"
  type: "EuclideanLoss"
  bottom: "deconv0_crop"
  bottom: "data"
  top: "recon_loss"
  loss_weight: 2e-3
#   loss_weight: 1e-10
}
